In [1]:
#05_panda_02_20160529

In [2]:
from pandas import Series, DataFrame #import Series,DataFrame

In [3]:
import pandas as pd #慣例

In [4]:
import numpy as np #import numpy as np

In [5]:
#Create a DataFrame from a dict of equal-length lists or NumPy arrays

In [6]:
dic_data= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}    #dict. object dic_data
                                      #值為等長的 list

In [7]:
frame1=DataFrame(dic_data) #create a dataframe object frame1 by DataFrame() function

In [8]:
frame1 #DataFrame Object, frame1

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [9]:
type(dic_data)

dict

In [10]:
type(frame1)

pandas.core.frame.DataFrame

In [11]:
#If you specify a sequence of columns, the DataFrame’s columns will be exactly 
#what you pass

In [12]:
DataFrame(dic_data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [13]:
# if you pass a column that isn’t contained in data, it will appear with NA 
# values in the result

In [14]:
frame2=DataFrame(dic_data, columns=['year', 'state', 'pop', 'debt'],
                index=['one', 'two', 'three', 'four', 'five'])

In [15]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [16]:
#A column in a DataFrame can be retrieved as a Series either by dict-like notation or by
#attribute:

In [17]:
s2=frame2['state'] #dict-like notation, 將column 'state' 擷取為 Series Object s2

In [18]:
s2 # Series Object s2

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [19]:
s3=frame2.year #attribute year, 將column 'year' 擷取為 Series Object s3

In [20]:
s3 #Series Object

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [21]:
type(s3)

pandas.core.series.Series

In [22]:
#Rows can also be retrieved by position or name by a couple of methods, such as the
#ix indexing field

In [23]:
s4=frame2.ix['three'] #ix, 將row three 擷取為 Series Object s4

In [24]:
s4 #Series Object, name屬性已被指定為 'three'

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [25]:
s5=frame2.ix[4] #ix[], 將row [4] 擷取為 Series Object s5

In [26]:
s5

year       2002
state    Nevada
pop         2.9
debt        NaN
Name: five, dtype: object

In [27]:
#Columns can be modified by assignment.

In [28]:
frame2['debt']=15.8 # 整個debt column 給定值 15.8

In [29]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  15.8
two    2001    Ohio  1.7  15.8
three  2002    Ohio  3.6  15.8
four   2001  Nevada  2.4  15.8
five   2002  Nevada  2.9  15.8

In [30]:
frame2['debt']=np.arange(5.)

In [31]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [32]:
#When assigning lists or arrays to a column, the value’s
#length must match the length of the DataFrame.

In [33]:
series09=Series([-1.4,-2.5,-1.8],index=['two','four','five']) 
                 #Series Object series09

In [34]:
series09

two    -1.4
four   -2.5
five   -1.8
dtype: float64

In [35]:
frame2['debt']=series09 #將series09 指給 column 'debt'

In [36]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.4
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -2.5
five   2002  Nevada  2.9  -1.8

In [37]:
#Assigning a column that doesn’t exist will create a new column.

In [40]:
frame2['eastern']=frame2.state=='Ohio' #frame2之前並不存在column 'eastern' 
                  #frame2.state=='Ohio' ,將產生一布林陣列

In [38]:
frame2.state=='Ohio' #產生一布林陣列

one       True
two       True
three     True
four     False
five     False
Name: state, dtype: bool

In [41]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.4    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -2.5   False
five   2002  Nevada  2.9  -1.8   False

In [42]:
#The del keyword will delete columns as with a dict

In [43]:
del frame2['eastern'] #delete column 'eastern'

In [44]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.4
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -2.5
five   2002  Nevada  2.9  -1.8

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.4
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -2.5
five   2002  Nevada  2.9  -1.8

In [45]:
frame2.columns #檢視 frame2 的 columns, 'eastern' column 已被刪除

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
#a nested dict of dicts format data

In [55]:
nested_dict={'Acer':{2015:13.4,2016:15.7},
             'Asus':{2014:23.0,2015:14.4,2016:20.8}}

In [56]:
#If passed to DataFrame, it will interpret the outer dict keys as the columns and
#the inner keys as the row indices

In [57]:
frame3=DataFrame(nested_dict) #create DataFrame Object frame3

In [58]:
frame3 #注意! 2014 Acer 為 null__

      Acer  Asus
2014   NaN  23.0
2015  13.4  14.4
2016  15.7  20.8

In [51]:
#transpose the DataFrame

In [52]:
frame3.T

      2014  2015  2016
Acer   NaN  13.4  15.7
Asus  23.0  14.4  20.8

In [53]:
DataFrame(nested_dict,index=[2013,2014,2015,2016])
          #顯式指定index

      Acer  Asus
2013   NaN   NaN
2014   NaN  23.0
2015  13.4  14.4
2016  15.7  20.8

In [54]:
frame3 #目前 DataFrame Object, frame3

      Acer  Asus
2014   NaN  23.0
2015  13.4  14.4
2016  15.7  20.8

In [55]:
frame3['Acer'][:-1] #[:-1] -->切取最後一個以前
                    #結果是一個 Series Object

2014     NaN
2015    13.4
Name: Acer, dtype: float64

In [56]:
frame3['Asus'][:2] #[:2] -->切取[0],[1] 兩個
                   #結果是一個 Series Object

2014    23.0
2015    14.4
Name: Asus, dtype: float64

In [57]:
#將上兩個切片(Series Object) 拿來做字典的值, 所以字典的值資料型別是Series
pdata={'Acer':frame3['Acer'][:-1],
       'Asus':frame3['Asus'][:2]}

In [58]:
DataFrame(pdata) #以dict pdata當引數,叫用DataFrame()

      Acer  Asus
2014   NaN  23.0
2015  13.4  14.4

In [59]:
#設定DataFrame Object 的index和column的name屬性

In [60]:
frame3.index.name='年度';frame3.columns.name='公司'

In [61]:
frame3

公司    Acer  Asus
年度
2014   NaN  23.0
2015  13.4  14.4
2016  15.7  20.8

In [62]:
#Like Series, the values attribute returns the data contained 
#in the DataFrame as a 2D ndarray:

In [63]:
frame3.values #type 為 np.ndarray objcet

array([[  nan,  23. ],
       [ 13.4,  14.4],
       [ 15.7,  20.8]])

In [64]:
frame3.index

Int64Index([2014, 2015, 2016], dtype='int64', name='年度')

In [65]:
frame3.columns

Index(['Acer', 'Asus'], dtype='object', name='公司')

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.4
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -2.5
five   2002  Nevada  2.9  -1.8

In [67]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.4],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -2.5],
       [2002, 'Nevada', 2.9, -1.8]], dtype=object)

In [68]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [69]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')